test/request-response-samples/OneWay__should_handle_one_way_operation/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.OneWay.com" xmlns:n="http://www.OneWay.com/Name/Types"><soap:Body><n:OneWayRequest xmlns:n="http://www.OneWay.com/Name/Types" xmlns="http://www.OneWay.com/Name/Types"><n:OneWayField>never coming back</n:OneWayField></n:OneWayRequest></soap:Body></soap:Envelope>